<?php
// +----------------------------------------------------------------------
// | 星数 [ xsframe赋能开发者，助力企业发展 ]
// +----------------------------------------------------------------------
// | Copyright (c) 2020~2023 https://www.xsframe.com All rights reserved.
// +----------------------------------------------------------------------
// | Licensed 星数PHP并不是自由软件，未经许可不能去掉xsframe相关版权
// +----------------------------------------------------------------------
// | Author: GuiHai <786824455@qq.com>
// +----------------------------------------------------------------------

// xs_form/config/menu.php

$menu = [
    'form' => [
        'title'    => '表单',
        'subtitle' => '表单案例',
        'icon'     => 'icon-file-text-o',
        'items'    => [
            [
                'title' => '基础表单',
                'route' => 'basic/main',
            ],
            [
                'title' => '组件表单',
                'route' => 'module/main',
            ],
            [
                'title' => '系统图标',
                'route' => 'icon/main',
            ],
        ]
    ],
    'sets' => [
        'title'    => '设置',
        'subtitle' => '设置管理',
        'icon'     => 'icon-cog',
        'items'    => [
            [
                'title' => '应用设置',
                'route' => 'module',
            ],
        ]
    ],
];
return $menu;